{"_id":{"$oid":"6241a8b1a8b781769b53ef0c"},"Que":"How do I become a member?","Ans":"To register on My Turn2Opinion, you will be asked to provide some basic questions while creating your account, as well as the option to provide some more in-depth information about yourself in order to participate in our surveys. After sign up, you will be sent a confirmation email in order to finalize your registration. You must click the link in this email to confirm your registration on My Turn2Opinions and in order to participate in surveys."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef0d"},"Que":"Any hidden charges while registration?","Ans":"Registration to My Turn2Opinion is completely free - you will not be asked for any payment. On the contrary, it is you who earns points that can be exchanged for vouchers by taking part in our surveys and participating in sponsored surveys."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef0e"},"Que":"Why should I become a member of My Turn2Opinion?","Ans":"Becoming a member lets you take part in surveys on different topics. You can then start to accumulate the rewards that are redeemable for an incentive of your choice listed on Rewards page"}
{"_id":{"$oid":"6241a8b1a8b781769b53ef0f"},"Que":"How do I change my email address and password?","Ans":"Login, then on the Profile picture section, select Profile. Enter your password and then click Update. And to change Email addrress you need to contact the administrator."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef10"},"Que":"How can I edit my personal information?","Ans":"Login, then on the Profile picture section, select Profile. Enter your new details and then click Update"}
{"_id":{"$oid":"6241a8b1a8b781769b53ef11"},"Que":"How can I cancel my account?","Ans":"You Need To Contact your adminsitrator to cancel your account."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef12"},"Que":"How do I participate in Surveys?","Ans":"Once you have registered on My Turn2Opinion, verify your email by clicking on the link you receive in your mailbox. If a survey matches your profile, you will receive an invitation by email. The more up-to-date your Profile Surveys are, the more chances you have of being invited to take part in surveys you qualify."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef13"},"Que":"How many points will I earn for my participation?","Ans":"The reward varies depending on the length of the survey. You have to complete a survey to receive the reward."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef14"},"Que":"How many surveys will I be invited to?","Ans":"The number of surveys you receive will vary depending on what personal settings you have and how many surveys are currently available. You can login to your account and under \"Profile\" tab, you can select \"Ideal survey frequency\" as per your choice. We encourage you to keep your profile up to date and increase the chance of getting more surveys."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef15"},"Que":"Technical difficulties with a survey, and why does this happen?","Ans":"One of the major reason behind technical issues is that survey respondents are using a variety of operating systems, browsers, Internet connection types, and hardware, and not all are necessarily compatible with the technology of all surveys that may be available. If you encounter a technical difficulty with a survey, usually, if you wait for a while, and try again later, the problem will be resolved. If you are still seeing an error after waiting a while, please report it to us with a screen shot, if possible. We apologize for any inconvenience caused by technical errors. We will do our best to get them resolved."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef16"},"Que":"Why does My Turn2Opinions ask the same questions in almost every survey?","Ans":"Our profiling process is continuous. The objective is to have broad and current attributes on each member. Our clients makes decisions based on responses from our members in their surveys. Implementing strict quality controls helps us make sure you are part of the target the client is looking for. The questions at the beginning of each survey may seem repetitive but are necessary to ensure the integrity of panellists."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef17"},"Que":"When I click on the survey link, it says \"Survey is closed\". What does that mean?","Ans":"From our experience we know that not everyone has time or opportunity to participate in all the surveys we send out. For instance, someone might be on vacation and cannot participate in a specific survey. The survey is therefore sent to a large number of people and it is closed when a desired number of participants have been reached. Thereafter, no more panellists can participate in the survey. If you get this message, it means we already have number of participants we are looking for. Please know that more survey opportunities will become available."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef18"},"Que":"How will I receive my rewards?","Ans":"Electronic vouchers (e-gift vouchers) will be sent to your registered email address. PayPal requests will be credited directly to your PayPal account. Please ensure all of your information is correct to avoid any delays."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef19"},"Que":"How long will it take to receive my reward once redeemed?","Ans":"From the moment you redeem rewards from your account, it can take up to 2-3 weeks before the transfer is actually executed. This could be due to several other transfers being queued for execution. Please ensure all of your information is correct to avoid any delays."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef1a"},"Que":"What is done with the information I filled out when signing up?","Ans":"Your profile data is stored on our secure server that allows us to call upon those members who match specific criteria to participate in surveys. This process is completely automated and members are contacted by My Turn2Opinions via email to participate in our surveys. All responses are held in aggregate, which means that individual responses are not linked to personally identifiable information. The information you provide will never be sold or used to advertise. You are not responsible for buying any product or service at any time, nor will any company solicit you as a result of joining My Turn2Opinion panel."}
{"_id":{"$oid":"6241a8b1a8b781769b53ef1b"},"Que":"Why do you ask questions about age, income and other personal information?","Ans":"This information is used to match members with specific survey requirements. In some cases our clients require feedback from people in a certain income bracket or those who have children. Please be assured that this information is securely kept and strictly confidential. The more information you provide, the greater are your chances of receiving invitations to surveys you may qualify for, and the more opportunities you may receive to earn rewards. Go through our privacy policy for more details."}
