[
    {
        "date":"Feb 20 2021",
        "img":"01.jpg",
        "name":"Praveen Mehta",
        "country":"India",
        "comment":"Earn money is never been so easy before, It's very good to share my opinion and get excellent rewards point. I'm so happy to earn money from Frequent Reward.."
        
    },
    {
        "date":"Mar 25 2021",
        "img":"02.jpg",
        "name":"Smith",
        "country":"United States",
        "comment":"Quick redemption. Cheers"
    },
    {
        "date":"Apr 25 2021",
        "img":"03.jpg",
        "name":"Amanda",
        "country":"France",
        "comment":"Amazing website and one of Best surveys website"
    },
    {
        "date":"May 27 2021",
        "img":"04.jpg",
        "name":"Eadfrith",
        "country":"United Kingdom",
        "comment":"The clear design and technical functionality of the surveys are excellent! Very impressive function to explore more surveys."
    },
    {
        "date":"Jul 15 2021",
        "img":"05.jpg",
        "name":"Haden",
        "country":"Germany",
        "comment":"That's nice website give extra money for interesting services"
    },
    {
        "date":"Aug 16 2021",
        "img":"",
        "name":"Oscar",
        "country":"United States",
        "comment":"Easy process for registration, impressive payoff for our feedback"
    },
    {
        "date":"Oct 5 2021",
        "img":"",
        "name":"Gaera",
        "country":"United States",
        "comment":"I really enjoy taking surveys through Turn2opinion. I feel they offer great promotions and reward their users very well. They also have an amazing customer service with timely responses and great follow through. Thank you!"
    },
    {
        "date":"Nov 17 2021",
        "img":"",
        "name":"Gavin",
        "country":"United States",
        "comment":"I've been using turn2opinion for around 4 or 5 years now, and not once in those years have I had a bad experience. Plenty of different survey engines to work from, and if you don't want to do surveys then you're free to do offers and play mobile games."
    },
    {
        "date":"Dec 28 2021",
        "img":"",
        "name":"Geetika",
        "country":"India",
        "comment":"If you like taking surveys this has to be the site for you. There's always plenty of surveys and the money soon mounts up. You can cash out with as little as a $2 via paypal which is far better than sites that make you hang on until you've hit $20+."
    },
    {
        "date":"Feb 11 2022",
        "img":"",
        "name":"Wei",
        "country":"China",
        "comment":"Whoa, I was so excited when I checked my mail today! My $12 credit reedeem at my paypal account so quickly! Thanks so much, turn2opinion."
    }
]
